In [1]:
import pandas as pd
import numpy as np

In [ ]:
#In pandas we mainly deal with Series, DataFrames, Panels and 4D panels

In [2]:
tuple1 = (2,3,4,5)
s1 = pd.Series(tuple1)
s1

0    2
1    3
2    4
3    5
dtype: int64

In [3]:
type(s1)

pandas.core.series.Series

In [4]:
array1 = np.array([1,2,3,4,5])
array1

array([1, 2, 3, 4, 5])

In [5]:
type(array1)

numpy.ndarray

In [6]:
s3 = pd.Series(array1)
s3

0    1
1    2
2    3
3    4
4    5
dtype: int32

In [7]:
dict1 = {
    'Sagar': 22,
    'Rahul': 23,
    'Bandenawaz': 24,
    'Darshan': 23,
    'Satish': 22
}
dict1

{'Sagar': 22, 'Rahul': 23, 'Bandenawaz': 24, 'Darshan': 23, 'Satish': 22}

In [8]:
s4 = pd.Series(dict1)
s4

Sagar         22
Rahul         23
Bandenawaz    24
Darshan       23
Satish        22
dtype: int64

In [9]:
s4['Sagar']

22

In [10]:
s4.size

5

In [11]:
s4.shape

(5,)

In [12]:
s4.dtype

dtype('int64')

In [13]:
s4.ndim

1

In [14]:
s4.index

Index(['Sagar', 'Rahul', 'Bandenawaz', 'Darshan', 'Satish'], dtype='object')

In [16]:
s4.values

array([22, 23, 24, 23, 22], dtype=int64)

In [17]:
cars = {
    'model': ['Toyota','Lamborghini','BMW','Audi','Ferrari','Mercedes Benz'],
    'price': [34,67,89,45,49,78],
    'color': ['white','black','orange','brown','yellow','grey']
}

In [18]:
cars

{'model': ['Toyota', 'Lamborghini', 'BMW', 'Audi', 'Ferrari', 'Mercedes Benz'],
 'price': [34, 67, 89, 45, 49, 78],
 'color': ['white', 'black', 'orange', 'brown', 'yellow', 'grey']}

In [19]:
cars_d = pd.DataFrame(cars)
cars_d

           model  price   color
0         Toyota     34   white
1    Lamborghini     67   black
2            BMW     89  orange
3           Audi     45   brown
4        Ferrari     49  yellow
5  Mercedes Benz     78    grey

In [20]:
type(cars_d)

pandas.core.frame.DataFrame

In [22]:
cars_d['model'][4]

'Ferrari'

In [32]:
np.random.seed(10)
array1 = np.random.randint(20,50,(5,6))

In [29]:
students = ['Rahul','Rohit','Nikhil','Suneel','Anil']

In [30]:
Subjects = ['Physics','Chemistry','Mathematics','Computer Science','English','Kannada']

In [33]:
marks = pd.DataFrame(array1,index=students,columns=Subjects)
marks

        Physics  Chemistry  Mahtematics  Computer Science  English  Kannada
Rahul        29         49           24                35       20       37
Rohit        47         48           45                49       36       49
Nikhil       37         46           28                29       20       30
Suneel       28         42           24                39       36       24
Anil         35         31           42                44       31       46

In [34]:
type(marks)

pandas.core.frame.DataFrame

In [35]:
marks.size

30

In [36]:
marks.info()

<class 'pandas.core.frame.DataFrame'>
Index: 5 entries, Rahul to Anil
Data columns (total 6 columns):
 #   Column            Non-Null Count  Dtype
---  ------            --------------  -----
 0   Physics           5 non-null      int32
 1   Chemistry         5 non-null      int32
 2   Mahtematics       5 non-null      int32
 3   Computer Science  5 non-null      int32
 4   English           5 non-null      int32
 5   Kannada           5 non-null      int32
dtypes: int32(6)
memory usage: 160.0+ bytes

In [41]:
marks['Total Marks'] = marks.sum(axis=1)

In [42]:
marks

,Physics,Chemistry,Mahtematics,Computer Science,English,Kannada,Total Marks
Rahul,29,49,24,35,20,37,194.0
Rohit,47,48,45,49,36,49,274.0
Nikhil,37,46,28,29,20,30,190.0
Suneel,28,42,24,39,36,24,193.0
Anil,35,31,42,44,31,46,229.0

In [43]:
marks['Percentage']=round((marks['Total Marks']/3),2)

In [44]:
marks

,Physics,Chemistry,Mahtematics,Computer Science,English,Kannada,Total Marks,Percentage
Rahul,29,49,24,35,20,37,194.0,64.67
Rohit,47,48,45,49,36,49,274.0,91.33
Nikhil,37,46,28,29,20,30,190.0,63.33
Suneel,28,42,24,39,36,24,193.0,64.33
Anil,35,31,42,44,31,46,229.0,76.33

In [47]:
marks.rename(columns={'Mahtematics': 'Maths'},inplace=True)

In [48]:
marks

,Physics,Chemistry,Maths,Computer Science,English,Kannada,Total Marks,Percentage
Rahul,29,49,24,35,20,37,194.0,64.67
Rohit,47,48,45,49,36,49,274.0,91.33
Nikhil,37,46,28,29,20,30,190.0,63.33
Suneel,28,42,24,39,36,24,193.0,64.33
Anil,35,31,42,44,31,46,229.0,76.33

In [49]:
marks.drop(index=['Anil','Rahul'],inplace=True)
marks

,Physics,Chemistry,Maths,Computer Science,English,Kannada,Total Marks,Percentage
Rohit,47,48,45,49,36,49,274.0,91.33
Nikhil,37,46,28,29,20,30,190.0,63.33
Suneel,28,42,24,39,36,24,193.0,64.33

In [50]:
marks.sort_index()

,Physics,Chemistry,Maths,Computer Science,English,Kannada,Total Marks,Percentage
Nikhil,37,46,28,29,20,30,190.0,63.33
Rohit,47,48,45,49,36,49,274.0,91.33
Suneel,28,42,24,39,36,24,193.0,64.33

In [51]:
addition_data = pd.DataFrame({
    'Physics': 25,
    'Chemistry': 45,
    'Maths': 49,
    'Computer Science': 27,
    'English': 34,
    'Kannada': 39
    
},index=['Anil','Rahul'])

In [52]:
marks = pd.concat([marks,addition_data])
marks

,Physics,Chemistry,Maths,Computer Science,English,Kannada,Total Marks,Percentage
Rohit,47,48,45,49,36,49,274.0,91.33
Nikhil,37,46,28,29,20,30,190.0,63.33
Suneel,28,42,24,39,36,24,193.0,64.33
Anil,25,45,49,27,34,39,NaN,NaN
Rahul,25,45,49,27,34,39,NaN,NaN